Masmiseim36/nxpSDK/boards/frdmke15z/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_FTM(void);

/*! @name PORTC6 (number 81), UART1_RX_TGTMCU
  @{ */
#define PINTOOL_UART_DEBUG_UART_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_UART_DEBUG_UART_RX_PIN 6U     /*!<@brief PORTC pin index: 6 */
                                              /* @} */

/*! @name PORTC7 (number 80), UART1_TX_TGTMCU
  @{ */
#define PINTOOL_UART_DEBUG_UART_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_UART_DEBUG_UART_TX_PIN 7U     /*!<@brief PORTC pin index: 7 */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

/*! @name PORTB11 (number 74), SW2
  @{ */
#define PINTOOL_MISC_SW2_FGPIO FGPIOB /*!<@brief FGPIO device name: FGPIOB */
#define PINTOOL_MISC_SW2_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define PINTOOL_MISC_SW2_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_MISC_SW2_PIN 11U    /*!<@brief PORTB pin index: 11 */
                                    /* @} */

/*! @name PORTD0 (number 4), D4[1]/RGB_RED
  @{ */
#define PINTOOL_MISC_LED_RED_FGPIO FGPIOD /*!<@brief FGPIO device name: FGPIOD */
#define PINTOOL_MISC_LED_RED_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_LED_RED_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_LED_RED_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                        /* @} */

/*! @name PORTD3 (number 70), SW3
  @{ */
#define PINTOOL_MISC_SW3_FGPIO FGPIOD /*!<@brief FGPIO device name: FGPIOD */
#define PINTOOL_MISC_SW3_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_SW3_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_SW3_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                    /* @} */

/*! @name PORTD16 (number 21), D4[4]/RGB_GREEN
  @{ */
#define PINTOOL_MISC_LED_GREEN_FGPIO FGPIOD /*!<@brief FGPIO device name: FGPIOD */
#define PINTOOL_MISC_LED_GREEN_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_LED_GREEN_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_LED_GREEN_PIN 16U    /*!<@brief PORTD pin index: 16 */
                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
